In [ ]:
Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.

The result format is in the following example.

 

Example 1:

Input: 
Employees table:
+-------------+---------+--------+
| employee_id | name    | salary |
+-------------+---------+--------+
| 2           | Meir    | 3000   |
| 3           | Michael | 3800   |
| 7           | Addilyn | 7400   |
| 8           | Juan    | 6100   |
| 9           | Kannon  | 7700   |
+-------------+---------+--------+
Output: 
+-------------+-------+
| employee_id | bonus |
+-------------+-------+
| 2           | 0     |
| 3           | 0     |
| 7           | 7400  |
| 8           | 0     |
| 9           | 7700  |
+-------------+-------+
Explanation: 
The employees with IDs 2 and 8 get 0 bonus because they have an even employee_id.
The employee with ID 3 gets 0 bonus because their name starts with 'M'.
The rest of the employees get a 100% bonus.

In [1]:
import pandas as pd

In [16]:
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})

In [107]:
### Solution 1
employees['bonus'] = 0
employees.loc[(~employees.name.str.startswith('M')) & (employees['employee_id'].apply(lambda x: x % 2 !=0)),'bonus'] = employees['salary']
employees[['employee_id','bonus']]

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

In [195]:
### Solution 2
employees.assign(bonus = employees.apply(lambda x: x['salary'] if x['employee_id']% 2!=0 and not x['name'].startswith('M') else 0,axis =1))[['employee_id', 'bonus']].sort_values(by = 'employee_id')

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

In [194]:
### Solution 3

employees["bonus"] = employees.apply(lambda x : x["salary"] if x["employee_id"] % 2 != 0 and x["name"][0] != "M" else 0, axis = 1)
employees.loc[:, ['employee_id','bonus']].sort_values(by = 'employee_id')

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700